{
  "tracks" : [
    {"id":"t1","name":"Apps for Imaging Research",
      "description": "The RSNA Image Share network was created (under a contract with NIH/NIBIB) to enable radiologists to share medical images with patients using personal health record (PHR) accounts, giving patients control over their medical images and radiology reports. Beginning in 2017, Image Share has worked with the NIH Sync for Science (S4S) program, which is designed to allow patients to consent to have their medical records used for research and to enable research apps to search for and retrieve records from consenting patient from clinical systems for relevant research. Image Share is working on adding medical images and radiology reports to the body of records available for sharing through S4S. The approach uses a combination of FHIR resources and DICOM web services with SMART on FHIR authorization to first search for (FHIR resources) and then retrieve (DICOM web services) radiology images.",
      "scenarioIds":["s1-1","s1-2","s1-3"],
      "leadIds": ["p1","p2"]
    },
    {"id":"t2","name":"Attachments",
      "description": "Electronic attachments are a high priority for processing claims and other payer/provider interactions. Current thinking has attachment submissions occurring via X12 messaging. However, there is substantial interest in experimenting with FHIR-based messaging for exchanging attachments. This track will explore the feasibility of this approach.",
      "scenarioIds":["s2-1","s2-2","s2-3"],
      "leadIds": ["p3","p4"]},
    {"id":"t3","name":"Automated Profiling",
      "description": "There is a practical gap between documenting the clinical content in a healthcare domain via a domain analysis model, and the ability to deliver a corresponding FHIR implementation. While it is possible with existing manual tools to create FHIR Profiles in small numbers, when a domain requires 20, 50, or 100 profiles, efficient specification and automation is required. This track will to test a proposed methodology for creating FHIR profiles that should make it possible to convert a domain analysis model to a set of FHIR profiles in a relatively simple, efficient manner. This track will also test the accuracy of profiles generated, by generating patients that conform to the profiles and exchanging them between servers/testing for compliance.  NOTE: This Connectathon track is agnostic to the approaches to logical modeling and FHIR Profiling. It is being supported by the Standard Health Record team, but any and all methods of modeling and profiling are welcomed and encouraged.",
      "scenarioIds":["s3-1","s3-2","s3-3","s3-4"],
      "leadIds": ["p5"]},
    {"id":"t4","name":"Bulk Data","scenarios":[]},
    {"id":"t5","name":"Care Plan","scenarios":[]},
    {"id":"t6","name":"Catalog","scenarios":[]},
    {"id":"t7","name":"CDS Hooks","scenarios":[]},
    {"id":"t8","name":"Clinical Reasoning","scenarios":[]},
    {"id":"t9","name":"Clinical Research","scenarios":[]},
    {"id":"t10","name":"Consumer Centered Data Exchange","scenarios":[]},
    {"id":"t11","name":"Devices","scenarios":[]},
    {"id":"t12","name":"Direct","scenarios":[]},
    {"id":"t13","name":"Electronic Case Reporting","scenarios":[]},
    {"id":"t14","name":"Encounter","scenarios":[]},
    {"id":"t15","name":"Financial","scenarios":[]},
    {"id":"t16","name":"FHIR Documents","scenarios":[]},
    {"id":"t17","name":"FHIR Subscriptions","scenarios":[]},
    {"id":"t18","name":"Genomics","scenarios":[]},
    {"id":"t19","name":"IHE on FHIR","scenarios":[]},
    {"id":"t20","name":"Medical Device - UDI","scenarios":[]},
    {"id":"t22","name":"Patient Intro","scenarios":[]},
    {"id":"t23","name":"Patient Formal","scenarios":[]},
    {"id":"t24","name":"Patient Match","scenarios":[]},
    {"id":"t25","name":"Pharmacogenomics","scenarios":[]},
    {"id":"t26","name":"Provider Directory","scenarios":[]},
    {"id":"t27","name":"Scheduling","scenarios":[]},
    {"id":"t28","name":"Terminology Services","scenarios":[]},
    {"id":"t29","name":"Versioned API","scenarios":[]}
  ]
}